set_property SRC_FILE_INFO {cfile:C:/MyFiles/ARM_CP/AT426-BU-98000-r0p0-00rel0/hardware/m3_for_arty_a7/m3_for_arty_a7/m3_for_arty_a7.srcs/constrs_2/m3_for_arty_a7.xdc rfile:../../../m3_for_arty_a7.srcs/constrs_2/m3_for_arty_a7.xdc id:1} [current_design]
set_property SRC_FILE_INFO {cfile:C:/MyFiles/ARM_CP/AT426-BU-98000-r0p0-00rel0/hardware/m3_for_arty_a7/m3_for_arty_a7/m3_for_arty_a7.srcs/constrs_2/new/nexys4.xdc rfile:../../../m3_for_arty_a7.srcs/constrs_2/new/nexys4.xdc id:2} [current_design]
set_property src_info {type:XDC file:1 line:77 export:INPUT save:INPUT read:READ} [current_design]
set_property IOB FALSE [get_cells -hierarchical -regex .*daplink.*quad.*SCK_O_NE_4_FDRE_INST]
set_property src_info {type:XDC file:1 line:91 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name cpu_clk [get_pins m3_for_arty_a7_i/Clocks_and_Resets/clk_wiz_0/inst/mmcm_adv_inst/CLKOUT0]
set_property src_info {type:XDC file:1 line:92 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name qspi_clk [get_pins m3_for_arty_a7_i/Clocks_and_Resets/clk_wiz_0/inst/mmcm_adv_inst/CLKOUT1]
set_property src_info {type:XDC file:1 line:107 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name base_qspi_clk -source [get_pins -hierarchical -filter {NAME =~ m3_for_arty_a7_i/axi_quad_spi_0/sck_o}] -divide_by 1 [get_ports qspi_flash_sck*]
set_property src_info {type:XDC file:1 line:135 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -datapath_only -from [get_clocks cpu_clk] -to [get_clocks -include_generated_clocks qspi_clk] 16.000
set_property src_info {type:XDC file:1 line:136 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -datapath_only -from [get_clocks -include_generated_clocks qspi_clk] -to [get_clocks cpu_clk] 16.000
set_property src_info {type:XDC file:1 line:147 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -datapath_only -from [get_clocks cpu_clk] -to [get_clocks SWCLK] 16.000
set_property src_info {type:XDC file:1 line:148 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -datapath_only -from [get_clocks SWCLK] -to [get_clocks cpu_clk] 16.000
set_property src_info {type:XDC file:1 line:156 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -through [get_nets -hierarchical *qspi_sel] -to [get_clocks dap_qspi_clk]
set_property src_info {type:XDC file:1 line:212 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay  -clock [get_clocks base_qspi_clk] -max -add_delay 7.5 [get_ports qspi_flash_io?_io]
set_property src_info {type:XDC file:1 line:213 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay  -clock [get_clocks base_qspi_clk] -min -add_delay 1.5 [get_ports qspi_flash_io?_io]
set_property src_info {type:XDC file:1 line:214 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay  -clock [get_clocks base_qspi_clk] -max -add_delay 7.5 [get_ports qspi_flash_ss*]
set_property src_info {type:XDC file:1 line:215 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay  -clock [get_clocks base_qspi_clk] -min -add_delay 1.5 [get_ports qspi_flash_ss*]
set_property src_info {type:XDC file:1 line:217 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks base_qspi_clk] -max -add_delay 2.5 [get_ports qspi_flash_io?_io]
set_property src_info {type:XDC file:1 line:218 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks base_qspi_clk] -min -add_delay -3.5 [get_ports qspi_flash_io?_io]
set_property src_info {type:XDC file:1 line:219 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks base_qspi_clk] -max -add_delay 2.5 [get_ports qspi_flash_ss*]
set_property src_info {type:XDC file:1 line:220 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks base_qspi_clk] -min -add_delay -3.5 [get_ports qspi_flash_ss*]
set_property src_info {type:XDC file:1 line:263 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks cpu_clk] -add_delay 0.500 [get_ports reset*]
set_property src_info {type:XDC file:1 line:265 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -from [get_ports reset*] -to [get_clocks qspi_clk]
set_property src_info {type:XDC file:2 line:1 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN F16 [get_ports {DAPLink_tri_o[9]}]
set_property src_info {type:XDC file:2 line:2 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN D17 [get_ports {DAPLink_tri_o[4]}]
set_property src_info {type:XDC file:2 line:7 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN R15 [get_ports {dip_switches_4bits_tri_i[3]}]
set_property src_info {type:XDC file:2 line:8 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN M13 [get_ports {dip_switches_4bits_tri_i[2]}]
set_property src_info {type:XDC file:2 line:9 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN L16 [get_ports {dip_switches_4bits_tri_i[1]}]
set_property src_info {type:XDC file:2 line:10 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN J15 [get_ports {dip_switches_4bits_tri_i[0]}]
set_property src_info {type:XDC file:2 line:15 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN N14 [get_ports {led_4bits_tri_io[3]}]
set_property src_info {type:XDC file:2 line:16 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN J13 [get_ports {led_4bits_tri_io[2]}]
set_property src_info {type:XDC file:2 line:17 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN K15 [get_ports {led_4bits_tri_io[1]}]
set_property src_info {type:XDC file:2 line:18 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN H17 [get_ports {led_4bits_tri_io[0]}]
set_property src_info {type:XDC file:2 line:23 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN M17 [get_ports {push_buttons_4bits_tri_i[3]}]
set_property src_info {type:XDC file:2 line:24 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN M18 [get_ports {push_buttons_4bits_tri_i[2]}]
set_property src_info {type:XDC file:2 line:25 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN P18 [get_ports {push_buttons_4bits_tri_i[1]}]
set_property src_info {type:XDC file:2 line:26 export:INPUT save:INPUT read:READ} [current_design]
set_property PACKAGE_PIN N17 [get_ports {push_buttons_4bits_tri_i[0]}]
